app/controllers/categories_controller.rb

SELECT * FROM "categories" WHERE ("categories"."id" = 1)
---
  def index
    @category = Category.find(params[:id])