app/controllers/products_controller.rb

  def index

    @product = Product.find(params[:id])
---
SELECT * FROM "products" WHERE ("products"."id" = 4)