app/controllers/shop_controller.rb

  def index

    p = Product.new
    p.price = 50000
    p.name = 'Windows 7 64-bit BOX'
    #p.save

    @products = Product.all
---
SELECT * FROM "products"